frontend/controllers/StoredbooksController.php

SELECT * FROM `storedbooks` WHERE `id`='13'
---
    protected function findModel($id)
    {
        if (($model = Storedbooks::findOne(['id' => $id])) !== null) {