frontend/views/storedbooks/_form.php

SELECT * FROM `authors` ORDER BY `id`
---

    <?php
        //tato metoda slouzi k vypisu select menu, ktere ma jako jednotlive optiony vsechny autory z databaze autoru
        $authors = Authors::find()
            ->orderBy('id')
            ->all();