frontend/views/storedbooks/view.php

SELECT * FROM `authors` WHERE `id`=3
---
        ]) ?>
    </p>
    <?php
    $author = Authors::find()
    ->where(['id' => $model->authorid])
    ->one();