frontend/models/Storedbooks.php

    public function getAuthorLabel()
    {
        $author = Authors::find()
            ->where(['id' => $this->authorid])
            ->one();
---
SELECT * FROM `authors` WHERE `id`=1